Repository: pplupo/TinyWall
Catalog: TinyWall/Resources/Messages.*.resx
Languages: ar

source: All applications
ar: جميع التطبيقات

# AllFilesFileFilter
source: All files
ar: جميع الملفات

# AreYouSureYouWantToRemoveAllExceptions
source: Are you sure you want to remove all firewall exceptions?
ar: هل أنت متأكد من أنك تريد إزالة جميع استثناءات جدار الحماية؟

# CannotGetExecutablePathWhitelisting
source: Cannot get executable path. Whitelisting failed.
ar: لا يمكن الحصول على مسار قابل للتنفيذ. فشلت القائمة البيضاء.

source: Cannot get path of process.
ar: لا يمكن الحصول على مسار العملية.

# ClickOnAWindowWhitelisting
source: Click on the inner area of any open window to select its application for whitelisting.
ar: انقر فوق المنطقة الداخلية لأي نافذة مفتوحة لتحديد تطبيقها للإدراج في القائمة البيضاء.

# CommunicationWithTheServiceError
source: Communication with the TinyWall service encountered an error.
ar: واجه الاتصال بخدمة TinyWall خطأ.

# CompromisedApplication
source: {0}, possibly compromised
ar: {0} ، ربما تتعرض للخطر

# ConfigurationHasBeenExported
source: The configuration file has been successfully exported.
ar: تم تصدير ملف التكوين بنجاح.

# ConfigurationHasBeenImported
source: The configuration file has been successfully imported. Press Apply in the Manage window to make the new settings permanent.
ar: تم استيراد ملف التكوين بنجاح. اضغط على تطبيق في نافذة الإدارة لجعل الإعدادات الجديدة دائمة.

# ConfigurationImportError
source: Could not import configuration file.
ar: تعذر استيراد ملف التكوين.

# CouldNotApplySettingsInternalError
source: Could not apply firewall settings due to an internal error.
ar: تعذر تطبيق إعدادات جدار الحماية بسبب خطأ داخلي.

# CouldNotCloseProcess
source: Could not close process {0}({1}).
ar: تعذر إغلاق العملية {0}({1}).

source: Could not elevate privileges.
ar: لا يمكن رفع الامتيازات.

# CouldNotElevatePrivilegesForUpdate
source: Could not elevate privileges necessary for update.
ar: تعذر رفع الامتيازات اللازمة للتحديث.

# CouldNotWhitelistProcess
source: Could not whitelist process of {0}.
ar: تعذر إدراج عملية {0} في القائمة البيضاء.

source: Database is missing or corrupt.
ar: قاعدة البيانات مفقودة أو تالفة.

source: Default
ar: افتراضي

# DidYouInitiateTheUninstall
source: Did you initiate the uninstall/update of TinyWall?
ar: هل بدأت إلغاء تثبيت / تحديث TinyWall؟

source: Downloading update...
ar: جاري تحميل التحديث...

source: Download interrupted.
ar: توقف التنزيل.

# ErrorCheckingForUpdates
source: Cannot access the update server. The server might be down, or please make sure that TinyWall has been granted internet access, then try again.
ar: لا يمكن الوصول إلى خادم التحديث. قد يكون الخادم معطلا ، أو يرجى التأكد من منح TinyWall إمكانية الوصول إلى الإنترنت ، ثم حاول مرة أخرى.

# FirewallModeAllowOut
source: Allow outgoing
ar: السماح بالصادر

# FirewallModeBlockAll
source: Block all
ar: حظر الكل

# FirewallModeDisabled
source: Disabled
ar: ذوي الاحتياجات الخاصه

# FirewallModeLearn
source: Autolearn
ar: التعلم التلقائي

# FirewallModeNormal
source: Normal
ar: عادي

# FirewallModeUnknown
source: Unknown
ar: مجهول

# FirewallRulesForRecognizedChanged
source: Firewall rules for recognised {0} have been changed. Click this popup to edit the exception.
ar: تم تغيير قواعد جدار الحماية {0} المعترف بها. انقر فوق هذه النافذة المنبثقة لتحرير الاستثناء.

# FirewallRulesForUnrecognizedChanged
source: Firewall rules for unrecognised {0} have been changed. Click this popup to edit the exception.
ar: تم تغيير قواعد جدار الحماية {0} غير المعترف بها. انقر فوق هذه النافذة المنبثقة لتحرير الاستثناء.

source: Lock
ar: قفل

# NoUpdateAvailable
source: You have the newest version of TinyWall. No update necessary.
ar: لديك أحدث إصدار من TinyWall. لا يلزم التحديث.

source: Operation failed.
ar: فشلت العملية.

# PasswordFieldsDoNotMatch
source: Password fields do not match. Please verify your input.
ar: حقول كلمة المرور غير متطابقة. يرجى التحقق من المدخلات الخاصة بك.

source: Permanent
ar: دائم

# PleaseWaitWhileTinyWallChecksForUpdates
source: Please wait while TinyWall checks for available updates.
ar: يرجى الانتظار حتى يتحقق TinyWall من التحديثات المتاحة.

# PortListInvalid
source: The format of the port list is invalid. You can use one or more numbers in the range of 1-65535, separated by commas. An asterix (*) can also be used to refer to all possible ports.
ar: تنسيق قائمة المنافذ غير صالح. يمكنك استخدام رقم واحد أو أكثر في النطاق 1-65535 ، مفصولة بفواصل. يمكن أيضا استخدام asterix (*) للإشارة إلى جميع المنافذ الممكنة.

# SearchingPath
source: Searching: {0}
ar: جاري البحث: {0}

source: Search results:
ar: نتائج البحث:

# SettingHaveChangedRetry
source: The configuration has changed while you modified the preferences. To prevent losing settings, please make your changes again.
ar: تم تغيير التكوين أثناء تعديل التفضيلات. لمنع فقدان الإعدادات ، يرجى إجراء التغييرات مرة أخرى.

source: Start
ar: بدء

source: Starting update...
ar: جاري بدء التحديث...

source: Stop
ar: وقف

# SubjectTypeExecutable
source: Executable
ar: التنفيذي

# SubjectTypeService
source: Service
ar: خدمة

# SubjectTypeUwpApp
source: UWP Package
ar: حزمة UWP

source: Success.
ar: نجاح.

# TheFirewallIsNowAllowsOutgoingConnections
source: The firewall is now allowing outgoing connections but blocks incoming.
ar: يسمح جدار الحماية الآن بالاتصالات الصادرة ولكنه يحظر الواردة.

# TheFirewallIsNowBlockingAllInAndOut
source: The firewall is now blocking all inbound and outbound traffic.
ar: يقوم جدار الحماية الآن بحظر جميع حركة المرور الواردة والصادرة.

source: The firewall is now disabled.
ar: تم تعطيل جدار الحماية الآن.

# TheFirewallIsNowLearning
source: The firewall is now learning while letting all traffic through.
ar: يتعلم جدار الحماية الآن مع السماح بمرور كل حركة المرور.

# TheFirewallIsNowOperatingAsRecommended
source: The firewall is now operating in the recommended mode.
ar: يعمل جدار الحماية الآن في الوضع الموصى به.

# TheFirewallSettingsHaveBeenUpdated
source: The firewall settings have been successfully updated.
ar: تم تحديث إعدادات جدار الحماية بنجاح.

# TheTinyWallServiceIsUnavailable
source: The TinyWall service is unavailable. Please make sure it is installed and started, then retry.
ar: خدمة TinyWall غير متوفرة. يرجى التأكد من تثبيته وبدء تشغيله ، ثم أعد المحاولة.

# TinyWallHasBeenUnlocked
source: TinyWall has been unlocked. You may now issue commands that modify the configuration.
ar: تم إلغاء قفل TinyWall. يمكنك الآن إصدار أوامر تقوم بتعديل التكوين.

# TinyWallIsCurrentlyLocked
source: TinyWall is current locked. Unlock and retry.
ar: TinyWall مغلق حاليا. إلغاء القفل وإعادة المحاولة.

# TinyWallSettingsFileFilter
source: TinyWall Settings
ar: إعدادات TinyWall

source: TinyWall Updater
ar: المحدث TinyWall

# TrafficIn
source: In
ar: في

# TrafficOut
source: Out
ar: خارج

# UnblockApp
source: Related files found The selected executable could be part of {0}. To ensure that this application can be used without limitations, it is recommended to also unblock some other files.
ar: تم العثور على ملفات ذات صلة يمكن أن يكون الملف القابل للتنفيذ المحدد جزءا من {0}. لضمان إمكانية استخدام هذا التطبيق دون قيود ، يوصى أيضا بإلغاء حظر بعض الملفات الأخرى.

# UnblockAppCancel
source: Cancel whitelisting
ar: إلغاء القائمة البيضاء

# UnblockAppShowRelated
source: Show/hide related executables
ar: إظهار/إخفاء الملفات التنفيذية ذات الصلة

# UnblockAppUnblockAllRecommended
source: Unblock all recommended files
ar: إلغاء حظر جميع الملفات الموصى بها

# UnblockAppUnblockOnlySelected
source: Unblock the selected file only
ar: إلغاء حظر الملف المحدد فقط

source: Unknown application
ar: تطبيق غير معروف

source: Unlock
ar: فتح

# UnlockFailed
source: Unlock failed. Try again with another passphrase.
ar: فشل إلغاء القفل. حاول مرة أخرى باستخدام عبارة مرور أخرى.

source: Until reboot
ar: حتى إعادة التشغيل

# UpdateAvailable
source: A newer version {0} of TinyWall is available. Do you want to update now?
ar: يتوفر إصدار أحدث {0} من TinyWall. هل تريد التحديث الآن؟

# UpdateAvailableBubble
source: A newer version {0} of TinyWall is available. Click this bubble to start the update process.
ar: يتوفر إصدار أحدث {0} من TinyWall. انقر فوق هذه الفقاعة لبدء عملية التحديث.

source: Whitelisting cancelled.
ar: تم إلغاء القائمة البيضاء.

# XHour
source: {0} hour
ar: {0} ساعة

# XHours
source: {0} hours
ar: {0} ساعات

# XMinutes
source: {0} minutes
ar: {0} دقيقة

# YouAreAboutToEnterLearningMode
source: Are you sure you want to start automatic learning? In its automatic learning mode TinyWall will allow all traffic and remember which applications have used the network. When you exit learning mode, TinyWall will add exceptions for you automatically. Note however, that rules cannot be learned for "Special Exceptions" of the configuration. Before entering learning mode, make sure that your system is free of any malware. It is best to run learning mode on freshly installed systems and it is recommended that you check your computer for viruses before using this mode. Do you want to enter learning mode now?
ar: هل أنت متأكد من أنك تريد بدء التعلم التلقائي؟ في وضع التعلم التلقائي ، سيسمح TinyWall بكل حركة المرور وتذكر التطبيقات التي استخدمت الشبكة. عند الخروج من وضع التعلم ، سيضيف TinyWall استثناءات لك تلقائيا. لاحظ مع ذلك أنه لا يمكن تعلم قواعد "الاستثناءات الخاصة" للتكوين. قبل الدخول في وضع التعلم ، تأكد من خلو نظامك من أي برامج ضارة. من الأفضل تشغيل وضع التعلم على الأنظمة المثبتة حديثا ويوصى بفحص جهاز الكمبيوتر الخاص بك بحثا عن الفيروسات قبل استخدام هذا الوضع. هل تريد الدخول إلى وضع التعلم الآن؟

# YouDoNotHaveAdministrativePrivilegesNeeded
source: You do not have administrative privileges needed to perform this operation. Select Elevate from the tray menu and try again.
ar: ليس لديك امتيازات إدارية مطلوبة لتنفيذ هذه العملية. حدد رفع من قائمة الدرج وحاول مرة أخرى.
