Repository: pplupo/TinyWall
Catalog: TinyWall/ApplicationExceptionForm.*.resx
Languages: ar, cs, es, fr, ja, ko

# btnCancel.Text
source: Cancel
ar: إلغاء الأمر
cs: Zrušit
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소

# btnOK.Text
source: OK
ar: حسنًا
es: Aplicar
fr: Valider
ko: 확인

# btnBrowse.Text
source: Browse for a file...
ar: استعرض بحثا عن ملف...
cs: Najít soubor...
es: Buscar archivo...
fr: Choisir fichier...
ja: ファイルを参照...
ko: 파일 찾아보기...

# btnProcess.Text
source: Select a process...
ar: حدد عملية...
cs: Vybrat proces...
es: Seleccionar proceso...
fr: Choisir processus...
ja: プロセスを選択...
ko: 프로세스 선택...

# btnChooseService.Text
source: Choose a service...
ar: اختر خدمة...
cs: Zvolit službu...
es: Elegir servicio...
fr: Choisir service...
ja: サービスを選択...
ko: 서비스 선택...

# ofd.Title
source: Select application executable
ar: حدد التطبيق القابل للتنفيذ
cs: Zvolit spustitelný soubor aplikace
es: Seleccionar ejecutable del programa
fr: Sélectionner exécutable
ja: プログラムを選択
ko: 응용 프로그램 실행 파일 선택

# label6.Text
source: Exception lifetime:
ar: عمر الاستثناء:
cs: Platnost vyjímky:
es: Duración excepción:
fr: Durée exception
ja: 恒久的に除外:
ko: 예외 기간:

# transparentLabel1.Text
source: Recognised placeholder
ar: العنصر النائب المعترف به
es: Reconocido espacio reservado
fr: Espace réservé reconnu
ja: 認識されたプレースフォルダ
ko: 자리 표시자 인식

# chkRestrictToLocalNetwork.Text
source: Restrict to local network
ar: التقييد بالشبكة المحلية
cs: Omezit na lokální síť
es: Restringir a red local
fr: Restreindre au réseau local
ja: ローカルネットワークに制限
ko: 로컬 네트워크로 제한

# radBlock.Text
source: Always block all traffic
ar: قم دائما بحظر كل حركة المرور
cs: Blokovat veškerou komunikaci
es: Bloquear siempre todo el tráfico
fr: Toujours bloquer tout le trafic
ja: すべてのトラフィックを常時遮断
ko: 항상 모든 트래픽 차단

# radTcpUdpOut.Text
source: Allow outgoing UDP and TCP traffic
ar: السماح بحركة مرور UDP وTCP الصادرة
cs: Povolit odchozí UDP a TCP komunikaci
es: Permitir tráfico saliente de UDP y TCP
fr: Autoriser le trafic UDP et TCP sortant
ja: UDP と TCP トラフィックの送信を許可
ko: 송신 UDP 및 TCP 트래픽 허용

# radTcpUdpUnrestricted.Text
source: Unrestricted UDP and TCP traffic
ar: حركة مرور UDP وTCP غير مقيدة
cs: Neomezená UDP a TCP komunikace
es: Sin restricciones de tráfico UDP y TCP
fr: Autoriser tout le trafic UDP et TCP
ja: UDP と TCP トラフィックの制限なし
ko: 제한 없는 UDP 및 TCP 트래픽

# radUnrestricted.Text
source: No restrictions
cs: Bez omezení
es: Sin restricciones
fr: Aucune restriction
ja: 無制限
ko: 제한 없음

# label5.Text
source: Open up the following ports, in addition to the restrictions above. (Comma-separated list)
ar: افتح المنافذ التالية ، بالإضافة إلى القيود المذكورة أعلاه. (قائمة مفصولة بفواصل)
cs: Otevřít následující porty pro doplnění nastavení výše. (list oddělen čárkami)
es: Abrir los siguientes puertos, además de las restrinciones de arriba. (Lista separada por comas)
fr: Ouvrir les ports suivants, en plus des restrictionsci-dessus. (séparer la liste des ports avec des virgules)
ja: 上記の制限に加えて以下のポートを開く (カンマ区切り)
ko: 위의 제한 이외에 다음의 포트를 엽니다. (쉼표로 구분된 목록)

# txtListenPortUDP.AccessibleName
source: Incoming UDP
ar: UDP الوارد
cs: Příchozí UDP
es: UDP entrante
fr: UDP entrant
ja: 受信する UDP
ko: 수신 UDP

# txtListenPortTCP.AccessibleName
source: Incoming TCP
ar: TCP الوارد
cs: Příchozí TCP
es: TCP entrante
fr: TCP entrant
ja: 受信する TCP
ko: 수신 TCP

# txtOutboundPortUDP.AccessibleName
source: Outgoing UDP
ar: UDP المنتهية ولايته
cs: Odchozí UDP
es: UDP saliente
fr: UDP sortant
ja: 送信する UDP
ko: 송신 UDP

# txtOutboundPortTCP.AccessibleName
source: Outgoing TCP
ar: TCP المنتهية ولايته
cs: Odchozí TCP
es: TCP saliente
fr: TCP sortant
ja: 送信する TCP
ko: 송신 TCP

# radOnlySpecifiedPorts.Text
source: Allow only specified ports
ar: السماح بمنافذ محددة فقط
cs: Povolit pouze určité porty
es: Permitir sólo los puertos especificados
fr: Autoriser seulement certains ports
ja: 指定されたポートのみ許可
ko: 지정한 포트만 허용

# $this.Text
source: Add/Modify Firewall Exception - TinyWall
ar: إضافة / تعديل استثناء جدار الحماية - TinyWall
cs: Přidat/Upravit vyjímku firewallu - TinyWall
es: Añadir/modificar excepción del cortafuegos - TinyWall
fr: Ajouter/Modifier exception - TinyWall
ja: 除外項目の追加/変更 - TinyWall
ko: 방화벽 예외 추가/수정 - TinyWall

# chkInheritToChildren.Text
source: Apply same rules to child processes
ar: تطبيق نفس القواعد على العمليات الفرعية
es: Aplicar mismas reglas a procesos hijo
ja: 子プロセスに同じ規則を適用
ko: 하위 프로세스에 동일한 규칙 적용

# btnSelectUwpApp.Text
source: Pick a UWP app...
ar: اختر تطبيق UWP ...
es: Elegir aplicación UWP...
ja: UWP アプリを選択...
ko: UWP 앱 선택

# btnRemoveSoftware.Text
source: Remove software
ar: إزالة البرامج
cs: Odebrání softwaru
es: Eliminar software
fr: Supprimer des logiciels
ja: ソフトウェアを削除する
ko: 소프트웨어 제거
